
-- Заполняет таблицу genres (жанры).
INSERT INTO genres(name)
VALUES('Джаз'),
      ('Ритм-н-Блюз'),
      ('Рок-шансон'),
      ('Русская поп-музыка'),
      ('Русская эстрада'),
      ('Русский реп'),
      ('Хип-хоп');

-- Заполняет таблицу singers (исполнители).
INSERT INTO singers(nickname)
VALUES('Burito'),
      ('Бьянка'),
      ('Глеб Матвейчук'),
      ('Григорий Лепс'),
      ('Лариса Долина'),
      ('Мот'),
      ('Стас Михаилов'),
      ('Тимати');

-- Заполняет таблицу genres_singers (жанры и исполнители).
INSERT INTO genres_singers(genre_id, singer_id)
VALUES(1, 5),
      (2, 8),
      (3, 4),
      (4, 1), (4, 2), (4, 3), (4, 4), (4, 5), (4, 8),
      (5, 4), (5, 5), (5, 7),
      (6, 6), (6, 8),
      (7, 6), (7, 8);

-- Заполняет таблицу albums (альбомы).
INSERT INTO albums(name, year)
VALUES('Капкан', 2020),
      ('Вместе навсегда', 2021),
      ('Водопад', 2009),
      ('Мысли в нотах', 2016),
      ('Наизнанку', 2016),
      ('Абсолютно всё', 2016),
      ('Код Да Винчи', 2022),
      ('Олимп', 2018),
      ('Дай мне уйти', 2016),
      ('Лондон', 2012),
      ('Новая русская мечта', 2016);

-- Заполняет таблицу singers_albums (исполнители и альбомы).
INSERT INTO singers_albums(singer_id, album_id)
VALUES(1, 1),
      (2, 4), (2, 6),
      (3, 2),
      (4, 3), (4, 9), (4, 10),
      (5, 1), (5, 2),
      (6, 5), (6, 6), (6, 11),
      (7, 7),
      (8, 8), (8, 9), (8, 10), (8, 11);

-- Добавляет в таблицу tracks новый атрибут url, ссылка на композицию.
ALTER TABLE tracks ADD COLUMN url VARCHAR(120);

-- Заполняет таблицу tracks (треки).
INSERT INTO tracks(name, duration, album_id, url)
VALUES('Капкан', 233, 1, '..\300_DataBase_data\Лариса Долина - Капкан feat Burito.mp3'),
      ('Вместе навсегда', 204, 2, '..\300_DataBase_data\Лариса Долина - Вместе навсегда feat Глеб Матвейчук.mp3'),
      ('Водопад', 252, 3, '..\300_DataBase_data\Григорий Лепс - Водопад.mp3'),
      ('Лодка', 219, 3, '..\300_DataBase_data\Григорий Лепс - Лодка.mp3'),
      ('Кеды', 179, 4, '..\300_DataBase_data\Бьянка - Кеды.mp3'),
      ('Ты мой', 201, 4, '..\300_DataBase_data\Бьянка - Ты мой.mp3'),
      ('Абсолютно всё', 188, 6, '..\300_DataBase_data\Мот - Абсолютно всё feat Бьянка.mp3'),
      ('Капкан', 228, 5, '..\300_DataBase_data\Мот - Капкан.mp3'),
      ('Невероятно', 200, 5, '..\300_DataBase_data\Мот - Невероятно.mp3'),
      ('Код Да Винчи', 210, 7, '..\300_DataBase_data\Стас Михаилов - Код Да Винчи.mp3'),
      ('Летят самолеты', 219, 7, '..\300_DataBase_data\Стас Михаилов - Летят самолеты.mp3'),
      ('Листопад', 191, 7, '..\300_DataBase_data\Стас Михаилов - Листопад.mp3'),
      ('Дай мне уйти', 246, 9, '..\300_DataBase_data\Тимати - Дай мне уйти feat Григорий Лепс.mp3'),
      ('Лондон', 263, 10, '..\300_DataBase_data\Тимати - Лондон feat Григорий Лепс.mp3'),
      ('Ключи от рая', 199, 8, '..\300_DataBase_data\Тимати - Ключи от рая.mp3'),
      ('Мага', 229, 8, '..\300_DataBase_data\Тимати - Мага.mp3'),
      ('Новая русская мечта', 231, 11, '..\300_DataBase_data\Тимати - Новая русская мечта feat Мот.mp3');

-- Заполняет таблицу collections (сборники).
INSERT INTO collections(name, year)
VALUES('Collection1', 2012),
      ('Collection2', 2014),
      ('Collection3', 2016),
      ('Collection4', 2018),
      ('Collection5', 2019),
      ('Collection6', 2020),
      ('Collection7', 2021),
      ('Collection8', 2022);

-- Заполняет таблицу tracks_collections (треки и сборники).
INSERT INTO tracks_collections(track_id, collection_id)
VALUES(4, 1), (14, 1),
      (6, 2), (7, 2), (8, 2), (9, 2),
      (6, 3), (13, 3), (14, 3), (17, 3),
      (7, 4), (13, 4), (15, 4), (16, 4),
      (3, 5), (5, 5), (9, 5), (15, 5),
      (1, 6), (8, 6), (16, 6), (17, 6),
      (2, 7), (3, 7), (4, 7), (5, 7),
      (10, 8), (11, 8);


-- Удаляет данные из таблицы.
DELETE FROM tracks_collections;

-- Удаляет саму таблицу.
DROP TABLE tracks_collections;
